# 集群

##  环境搭建

* 创建多个数据库文件夹

> mkdir p  ~/data/rs{1,2,3}

*  启动三个实例

```
mongod --replSet mdbDefGuide --dbpath  ~/data/rs1 --port  37017 -- smallfiles  --oplogSize  200 --bind_ip=192.168.39.63
mongod --replSet mdbDefGuide --dbpath  ~/data/rs2 --port  37018 -- smallfiles  --oplogSize  200 --bind_ip=192.168.39.63
mongod --replSet mdbDefGuide --dbpath  ~/data/rs3 --port  37019 -- smallfiles  --oplogSize  200 --bind_ip=192.168.39.63
```

* 启动新实例，然后初始化:

  mongo  --port 27017   --host 192.168.39.63

```
> rsconf = {
_id: "mdbDefGuide",   //启动命令对应的replset
members: [
{_id: 0, host: "localhost:27017"},
{_id: 1, host: "localhost:27018"},
{_id: 2, host: "localhost:27019"}]
}
> rs.initiate(rsconf)
{ "ok" : 1, "operationTime" : Timestamp(1501186502, 1) }
```

> 1：为了方便编辑，可以定义EDITOR="vim"来编辑这些js变量
>
> 2：这里需要注意一下，如果都是新启动的mongo实例，没有数据的话，可以发送这个配置到其他副本集，如果存在两个以上的副本集拥有数据，就不可以这样做了

```
> rs.status()  //来查看集群的情况
```

* 测试集群特性

```
# 在Primary上的操作
mdbDefGuide:PRIMARY> use test
mdbDefGuide:PRIMARY> for (i=0; i< 1000; i++)  {db.coll.insert({count:i})}
mdbDefGuide:PRIMARY> db.coll.count()
1000
```

```
# 在从上的操作
mdbDefGuide:SECONDARY> second=new Mongo("192.168.39.63:37018")
mdbDefGuide:SECONDARY> secondb = second.getDB("test")
mdbDefGuide:SECONDARY> secondb.coll.find()
Error: error: {
        "operationTime" : Timestamp(1600240745, 1),
        "ok" : 0,
        "errmsg" : "not master and slaveOk=false",
        "code" : 13435,
        "codeName" : "NotMasterNoSlaveOk",
        "$clusterTime" : {
                "clusterTime" : Timestamp(1600240745, 1),
                "signature" : {
                        "hash" : BinData(0,"AAAAAAAAAAAAAAAAAAAAAAAAAAA="),
                        "keyId" : NumberLong(0)
                }
        }
}
mdbDefGuide:SECONDARY> secondaryConn.setSlaveOk()
mdbDefGuide:SECONDARY> secondb.coll.count()
1000
```

> 由于从上的数据是比主上延迟的，因此默认是不支持从从上读取数据的。> secondaryConn.setSlaveOk() 可以告诉链接支持从从上读取数据，而不是整个数据库

```
# 在secondary上面测试写操作

mdbDefGuide:SECONDARY> secondb.coll.insert({"count":1001})
WriteCommandError({
        "operationTime" : Timestamp(1600241185, 1),
        "ok" : 0,
        "errmsg" : "not master",
        "code" : 10107,
        "codeName" : "NotMaster",
        "$clusterTime" : {
                "clusterTime" : Timestamp(1600241185, 1),
                "signature" : {
                        "hash" : BinData(0,"AAAAAAAAAAAAAAAAAAAAAAAAAAA="),
                        "keyId" : NumberLong(0)
                }
        }
})
```

* 副本集操作

```
# 增加副本集
> rs.add("localhost:27020")
# 减少副本集
> rs.remove("localhost:27017")
# 查看副本集
> rs.config()
# 直接修改副本集
> var config = rs.config()
> config.members[0].host = "localhost:27017"
> rs.reconfig(config)
```

## 选举逻辑

mongo有个“多数”的概念，就是大于集群节点一半的节点投票才可以当做primary

为什么要这样？ 为了防止出现网络分割的情况下，选举出来多个primary的情况。



<img src="https://i.loli.net/2020/09/16/Y9nWN8Ks7hGL3lV.png" alt="image-20200916154539549" style="zoom:10%;" />

如上图，如果存在网络分割，（1,2,3)集合会选举一个作为primary, （4,5）由于无法满足多数，因此无法选择primary.

> 由于目前对多primary的解决办法有两种：1：手动解决 2：设置一个机制选择一个master去处理，这两种方案对开发人员都不太友好，因此mongodb仅仅支持一个primary.

## 副本集设置

#### 优先级

优先级从0~100， **0是一种特殊的存在，不能当主，不接受读写操作，只做选举使用**

```
> rs.add({"host" : "server4:27017", "priority" : 1.5})
```

>  如果其他成员的优先级是1的话，那么server4的加入，如果能被其他成员访问，那么server4就会自己开始选举自己。

#### 隐藏成员

客户端不会转发消息给隐藏的成员（但是如果没有其他更好的资源的时候，也会发送给它），因此主要用来备份数据。     

```
mdbDefGuide:SECONDARY> rs.isMaster()
...
        "hosts" : [
                "192.168.39.63:37017",
                "192.168.39.63:37018",
                "192.168.39.63:37019"
        ],
...

> var config = rs.config()
> config.members[2].hidden = 0
0
>config.members[2].priority = 0
0
>rs.reconfig(config)
>rs.isMaster()  # 从中可以看到已经隐藏了一个
{
...
"hosts" : [
"server1:27107",
"server2:27017"
],
...
}
```

如果想要把这个成员设置为备份数据的话，可以去掉建立索引，一旦设置无法在修改过来了,priorify必须设置为0.

```
> config.members[2].buildIndexes = 0
0
>config.members[2].priority = 0
0
>rs.reconfig(config)

```

#### 选举仲裁者

启动参数是一样的mongod --replSet mdbDefGuide --dbpath  ~/data/rs0 --port  37020   --oplogSize  200 --bind_ip 192.168.39.63 >rs0.log&

```
## 添加到集群
mdbDefGuide:PRIMARY> rs.addArb("192.168.39.63:30720")
{
        "ok" : 1,
        "$clusterTime" : {
                "clusterTime" : Timestamp(1600246281, 1),
                "signature" : {
                        "hash" : BinData(0,"AAAAAAAAAAAAAAAAAAAAAAAAAAA="),
                        "keyId" : NumberLong(0)
                }
        },
        "operationTime" : Timestamp(1600246281, 1)
}
## 也可以通过以下命令进行添加
## > rs.add({"_id" : 4, "host" : "192.168.39.63:27020", "arbiterOnly" : true})
```

> 请注意： 一旦添加为仲裁者，就**无法通过修改配置**修改为普通的成员。
>
> 最多只用使用一个仲裁者，仅仅在节点是偶数的情况下使用。

建议尽量采用奇数的正常成员，而不是仲裁者，考虑以下情况：

在2个正常成员和一个仲裁者的情况，倘若一个正常成员完全挂掉并且数据无法恢复，再新启动一个正常成员的话，会存在数据拷贝的情况（从primary上面）。这样primary就会压力很大。如果存在一个secondary的话，就可以分担primary的数据同步压力。

